# GetMergedParts Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..GetMergedParts Method
PartUtils Class See Also
---
Retrieves the element ids of the source elements of a merged part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ICollection<ElementId> GetMergedParts(
	Part part
)
```

Visual Basic
---
```text
Public Shared Function GetMergedParts ( _
	part As Part _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetMergedParts(
	Part^ part
)
```

# ### Parameters
part
    Type: Autodesk.Revit.DB..::..Part A merged part.
# ### Return Value
The element ids of the parts that were merged to create the specified merged part.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The specified Part is not a merged part. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace